{
  "publishedAt": "14th Aug 2020",
  "featuredImage": "/images/uploads/colored.png",
  "title": "Education Classes Taken",
  "content": " The classes at Allegheny for the Education minor range from having slightly required classes while allowing students to choose electives that best fit their preferences. Classes required that I have taken are: EDU 100, EDU 543, EDU 544. EDU 100 is the introductory class for Education. In this class, students will talk about 'theories of learning, disseminating knowledge, and contemporary issues of education. Students examine how different cultures and individuals have described the ideal goals and practices of learning. Drawing on these readings, students develop their own pedagogical philosophy and test it against contemporary educational policies and trends. Students are introduced to qualitative and quantitative research data in education.'  The next round of classes that I took were elective based. These classes included: EDU 160, EDU 215, EDU 320. EDU 160 was English Language Learners. While this was not a class that directly related to a preference of mine, it became an eye opening class that allowed me to form more ideas and implementations for learning objectives that would help more students. EDU 160 specifically taught how to accomadate students that are not EnglishLanguage Learners as well as make sure they not only feel welcomed in a classroom, but that they do not feel different from other students.  EDU 215 was the next leveled class that I took and this was Special Education. The learning objectives with this class worked really with with that of English Language learners in understanding how different students learn in different atmospheres. We talked a bit about policy in this class as well which is important if you decide to go into that line of education as well as being a very intune teacher when it comes to seeing your students. The final elective class that I chose was EDU 320. This class was based on Educational Tests and Measures. In this class, students will have 'an exploration of the principles and methods of educational assessment, both small scale (teacher-constructed classroom assessments) and large-scale (nationally normed assessments). Tradeoffs between objectivity and subjectivity are emphasized with respect to their impact on the validity and reliability of different item types. Computation and interpretation of basic psychometric properties is required. Readings consider accurate inferences that can be drawn from educational assessments as well as the political, cultural, ethical, and individual factors that shape testing results'. My final two classes at Allegheny for the Education minor were EDU 543 and EDU 544. These clases were labeled as the Internship. It is the first class where students get to directly connect with students (of a prefered age) and tutor them. I, specfically, worked with a 7th grader and an 8th grader. WE focused primarily on math homework and math skills. I was able to see in action that students need to learn the exact same topics rather differently." 
}
